# Задание 3
# Какое слово нужно сложить 5 раз чтобы получить число 5?
# Какое слово нужно умножить на 7 чтобы получить 7?

list1 =[]
for i in range(5):
    total = 0
    total += 1
    list1.append(total)
    print(sum(list1))